{
    "HomeLink": {
        "title": "Home",
        "footer": "Go to the top of the page"
    },
    "about-section": {
        "title" : "About me",
        "description": "Hello! I'm Cristian Bernal, a Software and Networks Engineering student passionate about creating innovative technological solutions. My focus is on web development, with special attention to efficient controller implementation and effective error handling, for agile problem-solving. I continually seek to improve the efficiency and robustness of the systems I develop.",
        "DownloadButton": "Download CV",
        "href-CV": "/documents/AngelBernalCVen.pdf"
    },
    "skills-section" :{
        "title": "Skills"
    },
    "projects-section": {
        "title": "Projects",
        "title-OSPF": "Interconnection of LAN networks using OSPF 10 Multi-area.",
        "title-OSPF-ACL": "Interconnection of LAN networks using OSPF 15 Multi-area and ACL",
        "description-BlogApp": "Development of a full-stack blog application with user authentication using Clerk, middleware for route security, and content management features allowing authenticated users to create and edit posts. Additionally, includes functionality to display related posts and filter them by title and category",
        "description-ToDoApp": "Development of a task list application with a modular architecture, implementing controllers for efficient data flow. Effective error handling emphasized to enhance stability and user experience. Application security ensured by protecting sensitive routes through middleware.",
        "description-eCommerceApi": "Development of a robust API for an e-commerce platform, utilizing controllers to efficiently manage CRUD operations. Middleware implemented to protect critical routes and prevent unauthorized access. Application of coding best practices to ensure code maintainability and quality.",
        "description-LAN": "Router Configuration: IP_Host, Subnet Mask, On and OSPF 10 configuration. PC Configuration: IP_Host, Subnet Mask and Gateway.",
        "description-LAN-ACL": "Routers and PCs were configured by assigning IP addresses, subnet masks, and gateways. The OSPF protocol 15 was enabled on routers for dynamic routing management. Additionally, both standard and extended ACLs were implemented to control communication in the network: one blocks the network 166.16.166.0 to subnet 20.30.40.0, another prevents Laptop 4 from communicating with area 1, a third one prevents communication between Laptop 18 and Laptop 16, one more blocks traffic from subnet 10.20.30.0 to subnet 80.80.1.0, and the last one prevents communication between Laptop 5 and Laptop 6. These ACLs were applied on the respective output interface on the router to regulate traffic and ensure network security."
    },
    "contact-section": {
        "title": "Contact",
        "email": "Email:"
    },
    "LocaleSwitcher": {
        "label": "Change language",
        "locale": "{locale, select, es {Español} en {English} other {Unknown}}"
      }
}