{
    "HomeLink": {
        "title": "Inicio",
        "footer": "Ir al inicio de la pagina"
    },
    "about-section": {
        "title" : "Sobre mi",
        "description": "¡Hola! Soy Cristian Bernal, estudiante de ingenieria en Software y Redes apasionado por la creación de soluciones tecnológicas innovadoras. Mi enfoque se centra en el desarrollo web, con especial atención en la implementación de controladores eficientes y el manejo efectivo de errores, para la resolución ágil de problemas y busco continuamente mejorar la eficiencia y robustez de los sistemas que desarrollo.",
        "DownloadButton": "Descargar CV",
        "href-CV": "/documents/AngelBernalCV.pdf"
    }, 
    "projects-section": {
        "title": "Proyectos",
        "title-OSPF": "Interconexión de redes LAN usando OSPF 10 Multí area",
        "title-OSPF-ACL": "Interconexión de redes LAN usando OSPF 15 Multí area y ACL",
        "description-colab-web": "Colab Web es una aplicación web versátil diseñada para la gestión y colaboración de archivos de manera fluida. Con Colab Web, los usuarios pueden cargar y descargar archivos fácilmente, facilitando el intercambio dentro de las organizaciones. Impulsada por la tecnología de backend de Convex, la plataforma ofrece una página de vista general completa que permite a los usuarios navegar convenientemente por sus archivos, marcar favoritos e iniciar eliminaciones según sea necesario. Además, Colab Web cuenta con una sólida funcionalidad de chat que fomenta la comunicación fluida dentro de los equipos organizativos. Para las cuentas personales, la plataforma proporciona una interfaz de notas asegurando una experiencia de usuario intuitiva adaptada a las necesidades individuales.",
        "description-BlogApp": "Desarrollo de una aplicación de blog completa con autenticación y creación de usuarios utilizando Clerk con middleware para asegurar rutas y prevenir amenazas de seguridad. Se implementaron acciones para gestionar contenido permitiendo a los usuarios autenticados crear y editar sus posts. Además de la funcionalidad para mostrar posts relacionados y filtrarlos por título y categoría.",
        "description-ToDoApp": "Creación de una aplicación de lista de tareas con una arquitectura modular implementando controladores para un flujo de datos eficiente. Se enfatizó el manejo efectivo de errores para mejorar la estabilidad y la experiencia del usuario. Se garantizó la seguridad de la aplicación protegiendo las rutas sensibles mediante middleware.",
        "description-eCommerceApi": "Desarrollo de una API robusta para una plataforma de comercio electrónico, utilizando controladores para gestionar de manera eficiente las operaciones CRUD. Se implementó middleware para proteger rutas críticas y prevenir accesos no autorizados, y se aplicaron buenas prácticas de codificación para garantizar la mantenibilidad y calidad del código.",
        "description-LAN-ACL": "Se configuraron routers y PCs asignando direcciones IP, máscaras de subred y puertas de enlace. Se activó el protocolo OSPF 15 en los routers para la gestión dinámica de enrutamiento. Además, se implementaron ACL tanto estandar como extendidas para controlar la comunicación en la red: una bloquea la red 166.16.166.0 hacia la subred 20.30.40.0, otra evita que Laptop 4 se comunique con el área 1, una tercera previene la comunicación entre Laptop 18 y Laptop 16, una más bloquea el tráfico de la subred 10.20.30.0 hacia la subred 80.80.1.0, y una última impide la comunicación entre Laptop 5 y Laptop 6. Estas ACL se aplicaron en la interfaz de salida correspondiente en el router para regular el tráfico y garantizar la seguridad en la red."
    },
    
    "skills-section" :{
        "title": "Habilidades"
    },
    "contact-section": {
        "title": "Contacto",
        "email": "Correo:"
    },
    "LocaleSwitcher": {
        "label": "Cambiar lenguaje",
        "locale": "{locale, select, es {Español} en {English} other {Unknown}}"
      }
}